In [1]:
import pandas as pd

In [2]:
import io

In [3]:
import numpy as np

In [7]:
data=pd.read_csv("p1.csv")

In [8]:
data.head(5)

   sl_no   name qualification       phone  address
0      1    adi           msc   1589637.0      xyz
1      2    ram           mca  78956235.0      NaN
2      3  shree           mba         NaN     jjjj
3      4    raj            be   5898565.0  lllllll
4      5  geeta           bca         NaN   pppppp

In [10]:
data.drop_duplicates(subset=["name"],keep="last",inplace=True)

In [11]:
data.head(10)

   sl_no   name qualification        phone  address
0      1    adi           msc    1589637.0      xyz
1      2    ram           mca   78956235.0      NaN
2      3  shree           mba          NaN     jjjj
3      4    raj            be    5898565.0  lllllll
4      5  geeta           bca          NaN   pppppp
5      6   lata           bba    5457878.0    ddddd
6      7  seeta          bcom    2556487.0    aaaaa
7      8  ratna           bca    4545444.0      NaN
8      9   raji           mca  254554768.0  hhhhhhh

In [12]:
data.isnull().sum()

sl_no            0
name             0
qualification    0
phone            2
address          2
dtype: int64

In [13]:
print(data.shape)

(9, 5)

In [14]:
df_dropped=data.dropna()

In [15]:
data.head()

   sl_no   name qualification       phone  address
0      1    adi           msc   1589637.0      xyz
1      2    ram           mca  78956235.0      NaN
2      3  shree           mba         NaN     jjjj
3      4    raj            be   5898565.0  lllllll
4      5  geeta           bca         NaN   pppppp

In [16]:
data['address']=data['address'].fillna('sullia')

In [18]:
data.head(10)

   sl_no   name qualification        phone  address
0      1    adi           msc    1589637.0      xyz
1      2    ram           mca   78956235.0   sullia
2      3  shree           mba          NaN     jjjj
3      4    raj            be    5898565.0  lllllll
4      5  geeta           bca          NaN   pppppp
5      6   lata           bba    5457878.0    ddddd
6      7  seeta          bcom    2556487.0    aaaaa
7      8  ratna           bca    4545444.0   sullia
8      9   raji           mca  254554768.0  hhhhhhh

In [20]:
mean_val=data['phone'].mean()

In [21]:
data['phone']=data['phone'].fillna(mean_val)

In [22]:
data

   sl_no   name qualification         phone  address
0      1    adi           msc  1.589637e+06      xyz
1      2    ram           mca  7.895624e+07   sullia
2      3  shree           mba  5.050843e+07     jjjj
3      4    raj            be  5.898565e+06  lllllll
4      5  geeta           bca  5.050843e+07   pppppp
5      6   lata           bba  5.457878e+06    ddddd
6      7  seeta          bcom  2.556487e+06    aaaaa
7      8  ratna           bca  4.545444e+06   sullia
8      9   raji           mca  2.545548e+08  hhhhhhh

In [23]:
import pandas as pd
array=np.array([[1,1,1],[2,3,8],[3,4,27],])

In [24]:
index_values=['row1','row2','row3']

In [25]:
column_values=['col','col2','col3']

In [30]:
df=pd.DataFrame(data=array,
index=index_values,
columns=column_values)

In [31]:
print(df)

      col  col2  col3
row1    1     1     1
row2    2     3     8
row3    3     4    27

In [32]:
trace=np.trace(df)

In [33]:
print("Trace of the matrix",trace)

Trace of the matrix 31